#**Planilhas do Excel**

In [51]:
import pandas as pd

In [52]:
df1 = pd.read_excel(r"C:\Users\jeffe\PycharmProjects\Data_Analysis_Studies\Data_Analysis_Python_Pandas_DIO\datasets\Aracaju.xlsx")
df2 = pd.read_excel(r"C:\Users\jeffe\PycharmProjects\Data_Analysis_Studies\Data_Analysis_Python_Pandas_DIO\datasets\Fortaleza.xlsx")
df3 = pd.read_excel(r"C:\Users\jeffe\PycharmProjects\Data_Analysis_Studies\Data_Analysis_Python_Pandas_DIO\datasets\Natal.xlsx")
df4 = pd.read_excel(r"C:\Users\jeffe\PycharmProjects\Data_Analysis_Studies\Data_Analysis_Python_Pandas_DIO\datasets\Recife.xlsx")
df5 = pd.read_excel(r"C:\Users\jeffe\PycharmProjects\Data_Analysis_Studies\Data_Analysis_Python_Pandas_DIO\datasets\Salvador.xlsx")

In [53]:
df5.head()

     Cidade       Data  Vendas  LojaID  Qtde
0  Salvador 2018-01-01   31.06    1037     3
1  Salvador 2018-01-01   19.02    1034     3
2  Salvador 2019-02-10  173.59    1035     3
3  Salvador 2019-02-10  176.34    1037     3
4  Salvador 2019-02-14   19.47    1037     3

In [54]:
#juntando todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [55]:
#Exibindo as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [56]:
#Exibindo as 5 Ãºltimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [57]:
df.sample(5)

        Cidade       Data  Vendas  LojaID  Qtde
121  Fortaleza 2019-03-02   41.55     981     3
31      Recife 2019-01-01  176.23     981     7
204   Salvador 2019-01-02  151.41    1037     2
199   Salvador 2019-01-02  153.87    1036     3
51    Salvador 2019-01-01   13.37    1037     2

In [58]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [59]:
df["LojaID"] = df["LojaID"].astype("object")

In [60]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [61]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

**Tratando valores faltantes**

In [62]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [63]:
#Substituindo os valores nulos pela mÃ©dia
df["Vendas"].fillna(df["Vendas"].mean(), inplace=True)

In [64]:
df["Vendas"].mean()

122.61180089485458

In [65]:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [66]:
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
105      Natal 2019-01-02   32.83   1037     1
79    Salvador 2019-01-01   19.02   1034     2
84   Fortaleza 2019-01-01  147.46   1003     6
178   Salvador 2019-01-02   39.28   1037     3
212      Natal 2019-01-02   50.73   1037     3
216      Natal 2019-01-02    5.82   1035     1
93       Natal 2019-01-02   15.58   1037     1
32      Recife 2019-01-01   15.93    982     7
7      Aracaju 2019-01-01  172.22   1522     6
78   Fortaleza 2019-01-01   37.66   1005     2
164      Natal 2019-01-02    6.59   1035     1
19   Fortaleza 2019-01-01   18.86   1002     3
128      Natal 2019-01-02   36.84   1034     1
41      Recife 2019-02-13  157.78    981     4
214      Natal 2019-01-02   54.94   1036     2

In [67]:
#Substituindo os valores nulos por zero
df["Vendas"].fillna(0, inplace=True)

In [68]:
#Apagando as linhas com valores nulos
df.dropna(inplace=True)

In [69]:
#Apagando as linhas com valores nulos com base apenas em 1 coluna
df.dropna(subset=["Vendas"], inplace=True)

In [70]:
#Removendo linhas que estejam com valores faltantes em todas as colunas
df.dropna(how="all", inplace=True)

**Criando colunas novas**

In [71]:
df["Receita"] = df["Vendas"].mul(df["Qtde"])

In [72]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [73]:
df["Receita/Vendas"] = df["Receita"] / df["Vendas"]

In [74]:
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
0  Aracaju 2018-01-01  142.00   1520     1   142.00             1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26             6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55             1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07             7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08             8.0

In [75]:
#Retornando a maior receita
df["Receita"].max()

3544.0

In [76]:
#Retornando a menor receita
df["Receita"].min()

3.34

In [77]:
#nlargest
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0

In [78]:
#nsamllest
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
118  Aracaju 2018-01-01    3.34   1522     1     3.34             1.0
65    Recife 2019-01-01    4.01    981     1     4.01             1.0
92     Natal 2019-01-02    4.57   1035     1     4.57             1.0

In [79]:
#Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [80]:
#Ordenando o conjunto de dados
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Vendas
7   Natal 2019-03-18   886.0    853     4   3544.0             4.0
55  Natal 2019-01-08   859.0    854     4   3436.0             4.0
51  Natal 2018-01-21   859.0    852     4   3436.0             4.0
30  Natal 2018-10-02   856.0    853     4   3424.0             4.0
41  Natal 2018-05-20   835.0    852     4   3340.0             4.0
38  Natal 2018-02-25   828.0    852     4   3312.0             4.0
10  Natal 2018-10-27   828.0    852     4   3312.0             4.0
69  Natal 2019-03-24   817.0    852     4   3268.0             4.0
62  Natal 2018-02-10   793.0    854     4   3172.0             4.0
52  Natal 2018-04-27   778.0    854     4   3112.0             4.0

#**Trabalhando com datas**

In [81]:
df["Data"] = df["Data"].astype("int64")

In [82]:
df.dtypes

Cidade             object
Data                int64
Vendas            float64
LojaID             object
Qtde                int64
Receita           float64
Receita/Vendas    float64
dtype: object

In [83]:
#Transformando coluna de data em data
df["Data"] = pd.to_datetime(df["Data"])

In [84]:
df.dtypes

Cidade                    object
Data              datetime64[ns]
Vendas                   float64
LojaID                    object
Qtde                       int64
Receita                  float64
Receita/Vendas           float64
dtype: object

In [85]:
df.groupby(df["Data"].dt.year)["Receita"].sum()

Data
2018    118176.53
2019    228246.45
Name: Receita, dtype: float64

In [86]:
df["Ano_Venda"] = df["Data"].dt.year

In [87]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda
180,Salvador,2019-01-02,116.63,1035,2,233.26,2.0,2019
64,Fortaleza,2019-01-01,110.31,1005,4,441.24,4.0,2019
141,Recife,2019-03-02,182.75,983,8,1462.00,8.0,2019
74,Salvador,2019-01-01,170.53,1035,2,341.06,2.0,2019
108,Salvador,2019-03-02,11.72,1037,1,11.72,1.0,2019

In [88]:
#Extraindo o mÃªs e o dia
df["mes_venda"], df["dia_venda"] = (df["Data"].dt.month, df["Data"].dt.day)

In [89]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda
134,Fortaleza,2019-03-02,195.18,980,5,975.90,5.0,2019,3,2
18,Recife,2019-01-01,49.40,980,5,247.00,5.0,2019,1,1
105,Recife,2019-01-01,41.12,980,3,123.36,3.0,2019,1,1
125,Fortaleza,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2
65,Aracaju,2018-01-01,145.54,1522,3,436.62,3.0,2018,1,1

In [90]:
#Retornando a data mais antiga
df["Data"].min()

Timestamp('2018-01-01 00:00:00')

In [91]:
#Calculando a diferenÃ§a de dias
df["diferenca_dias"] = df["Data"] - df["Data"].min()

In [92]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias
229,Natal,2019-01-02,43.08,1036,2,86.16,2.0,2019,1,2,366 days
14,Fortaleza,2019-01-12,132.68,1005,1,132.68,1.0,2019,1,12,376 days
10,Fortaleza,2019-01-01,179.88,1002,4,719.52,4.0,2019,1,1,365 days
89,Salvador,2019-01-01,17.46,1034,1,17.46,1.0,2019,1,1,365 days
123,Natal,2019-01-02,127.45,1036,3,382.35,3.0,2019,1,2,366 days

In [93]:
#Criando a coluna de trimestre
df["trimestre_venda"] = df["Data"].dt.quarter

In [94]:
df.sample(5)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
199,Natal,2019-01-02,153.87,1036,3,461.61,3.0,2019,1,2,366 days,1
69,Natal,2019-03-24,817.00,852,4,3268.00,4.0,2019,3,24,447 days,1
231,Natal,2019-01-03,89.85,1034,2,179.70,2.0,2019,1,3,367 days,1
238,Salvador,2019-01-03,139.64,1035,1,139.64,1.0,2019,1,3,367 days,1
88,Recife,2019-01-01,180.24,980,6,1081.44,6.0,2019,1,1,365 days,1

In [95]:
#Filtrando as vendas de 2019 do mÃªs de marÃ§o
vendas_marco_19 = df.loc[(df["Data"].dt.year == 2019) & (df["Data"].dt.month == 3)]

In [96]:
vendas_marco_19.sample(20)

,Cidade,Data,Vendas,LojaID,Qtde,Receita,Receita/Vendas,Ano_Venda,mes_venda,dia_venda,diferenca_dias,trimestre_venda
132,Recife,2019-03-02,17.49,983,5,87.45,5.0,2019,3,2,425 days,1
132,Salvador,2019-03-02,19.61,1036,2,39.22,2.0,2019,3,2,425 days,1
133,Recife,2019-03-02,14.67,980,7,102.69,7.0,2019,3,2,425 days,1
122,Salvador,2019-03-02,13.27,1037,1,13.27,1.0,2019,3,2,425 days,1
66,Natal,2019-03-24,559.00,853,2,1118.00,2.0,2019,3,24,447 days,1
119,Recife,2019-03-02,152.30,982,7,1066.10,7.0,2019,3,2,425 days,1
141,Salvador,2019-03-02,9.08,1036,1,9.08,1.0,2019,3,2,425 days,1
75,Natal,2019-03-30,706.00,854,2,1412.00,2.0,2019,3,30,453 days,1
50,Natal,2019-03-08,324.00,854,4,1296.00,4.0,2019,3,8,431 days,1
126,Recife,2019-03-02,41.87,980,8,334.96,8.0,2019,3,2,425 days,1
134,Salvador,2019-03-02,125.90,1036,1,125.90,1.0,2019,3,2,425 days,1
119,Salvador,2019-03-02,136.37,1034,2,272.74,2.0,2019,3,2,425 days,1
115,Recife,2019-03-02,12.23,981,3,36.69,3.0,2019,3,2,425 days,1
111,Recife,2019-03-02,8.00,981,3,24.00,3.0,2019,3,2,425 days,1
118,Salvador,2019-03-02,92.21,1035,2,184.42,2.0,2019,3,2,425 days,1
137,Fortaleza,2019-03-02,51.99,983,3,155.97,3.0,2019,3,2,425 days,1
118,Fortaleza,2019-03-02,17.70,981,5,88.50,5.0,2019,3,2,425 days,1
125,Recife,2019-03-02,37.60,983,4,150.40,4.0,2019,3,2,425 days,1
82,Natal,2019-03-07,868.00,854,3,2604.00,3.0,2019,3,7,430 days,1
130,Salvador,2019-03-02,59.78,1036,1,59.78,1.0,2019,3,2,425 days,1